In [1]:
import numpy as np
import pandas as pd

In [4]:
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
print('PREVIOUS_MAX_ROWS ',PREVIOUS_MAX_ROWS)
pd.options.display.max_rows = 20
np.random.seed(123)

PREVIOUS_MAX_ROWS  60

In [5]:
CURRENT_MAX_ROWS = pd.options.display.max_rows
print('CURRENT_MAX_ROWS ',CURRENT_MAX_ROWS)

CURRENT_MAX_ROWS  20

In [6]:
import matplotlib.pyplot as plt

In [10]:
plt.rc('figure',figsize=(10,6))
np.set_printoptions(precision=4, suppress=True)

### Handling Missing Data

In [12]:
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
print(string_data)
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

In [19]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [20]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

In [18]:
from numpy.random import randn as rn
np.random.seed(101)
matrix_data=rn(5,4)
matrix_data

array([[ 2.7068,  0.6281,  0.908 ,  0.5038],
       [ 0.6511, -0.3193, -0.8481,  0.606 ],
       [-2.0182,  0.7401,  0.5288, -0.589 ],
       [ 0.1887, -0.7589, -0.9332,  0.9551],
       [ 0.1908,  1.9788,  2.606 ,  0.6835]])

### Filtering Out Missing Data

In [22]:
from numpy import nan as NA

In [30]:
data = pd.Series([1,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [24]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [31]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.dropna(inplace=True)

In [27]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [33]:
data[~data.isnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [34]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [36]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                   [NA,NA,NA],[NA,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [41]:
cleaned = data.dropna()
print('Cleaned DataFrame\n','-'*20,'\n',cleaned,'\n')
print('Original DataFrame\n','-'*20,'\n',data)

Cleaned DataFrame
 --------------------
      0    1    2
0  1.0  6.5  3.0

Original DataFrame
 --------------------
      0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [44]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [45]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [46]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [47]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.302665  1.693723 -1.706086
1 -1.159119 -0.134841  0.390528
2  0.166905  0.184502  0.807706
3  0.072960  0.638787  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [48]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA

In [49]:
df

          0         1         2
0  0.302665       NaN       NaN
1 -1.159119       NaN       NaN
2  0.166905       NaN  0.807706
3  0.072960       NaN  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [50]:
df.dropna()

          0         1         2
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [51]:
df.dropna(thresh=2)

          0         1         2
2  0.166905       NaN  0.807706
3  0.072960       NaN  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

### Filling In Missing Data

In [54]:
df.fillna(value=0)

          0         1         2
0  0.302665  0.000000  0.000000
1 -1.159119  0.000000  0.000000
2  0.166905  0.000000  0.807706
3  0.072960  0.000000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [55]:
df.fillna(value={1:0.5,2:0}) # First Column NA values were filled by 0.5, 2nd column NA values were filled by 0

          0         1         2
0  0.302665  0.500000  0.000000
1 -1.159119  0.500000  0.000000
2  0.166905  0.500000  0.807706
3  0.072960  0.500000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [56]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  0.302665  0.000000  0.000000
1 -1.159119  0.000000  0.000000
2  0.166905  0.000000  0.807706
3  0.072960  0.000000  0.329646
4 -0.497104 -0.754070 -0.943406
5  0.484752 -0.116773  1.901755
6  0.238127  1.996652 -0.993263

In [58]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241       NaN  1.292765
3 -1.467514       NaN -0.162535
4  0.485809       NaN       NaN
5 -0.855196       NaN       NaN

In [62]:
df.fillna(method='ffill')

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241 -2.141212  1.292765
3 -1.467514 -2.141212 -0.162535
4  0.485809 -2.141212 -0.162535
5 -0.855196 -2.141212 -0.162535

In [63]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.732845 -1.382920  1.482495
1  0.961458 -2.141212  0.992573
2  1.192241 -2.141212  1.292765
3 -1.467514 -2.141212 -0.162535
4  0.485809       NaN -0.162535
5 -0.855196       NaN -0.162535

In [64]:
data = pd.Series([1.,NA,3.5,NA,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [65]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Removing Duplicate

In [69]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [78]:
data.groupby(by=['k1']).k1.count()

k1
one    3
two    4
Name: k1, dtype: int64

In [79]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [80]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [81]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [83]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [85]:
data.drop_duplicates(['k1'],keep='first')

    k1  k2  v1
0  one   1   0
1  two   1   1

In [86]:
data.drop_duplicates(['k1'],keep='last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [87]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming data using Lambda Function

In [90]:
data = pd.DataFrame({'Food':['bacon','pulled pork','bacon',
                             'Pastrami','corned beef','Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                    'Ounces': [4,3,12,6,7.5,8,3,5,6]})
data

          Food  Ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [91]:
meat_to_animal = {
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [95]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [96]:
lowercased = data['Food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: Food, dtype: object

In [97]:
data['animal'] = lowercased.map(meat_to_animal)

In [98]:
data

          Food  Ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [100]:
data['Food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: Food, dtype: object

### Replacing values in place of missing values

In [102]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [105]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [106]:
data.replace([-999.,-1000.],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [108]:
data.replace([-999.,-1000.],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [109]:
data.replace({-999.:np.nan, -1000.:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Rename Axis Indexes

In [112]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index=['Ohio','Colorado','New Your'],
                   columns=['One','Two','Three','Four'])
data.index

Index(['Ohio', 'Colorado', 'New Your'], dtype='object')

In [113]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [115]:
list(map(transform,data.index))

['OHIO', 'COLO', 'NEW ']

In [116]:
data.index = data.index.map(transform)

In [117]:
data

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [118]:
data.rename(index=str.title, columns=str.title)

      One  Two  Three  Four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [119]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         One  Two  Three  Four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [120]:
data

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [122]:
data.rename(index={'OHIO':'INDIANA'}, inplace=True)

In [123]:
data

         One  Two  Three  Four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Binning or Bucketizing for contineous variables

In [124]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32 ]

In [125]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [126]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [127]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [128]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [129]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [130]:
pd.cut(ages,[18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [133]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [137]:
data = np.random.rand(20)
data

array([0.8923, 0.1106, 0.6258, 0.1008, 0.7109, 0.8813, 0.6953, 0.2662,
       0.91  , 0.5796, 0.3597, 0.8526, 0.2462, 0.7804, 0.0455, 0.885 ,
       0.2764, 0.5809, 0.9107, 0.9926])

In [138]:
pd.cut(data,bins = 4, precision=2)

[(0.76, 0.99], (0.045, 0.28], (0.52, 0.76], (0.045, 0.28], (0.52, 0.76], ..., (0.76, 0.99], (0.045, 0.28], (0.52, 0.76], (0.76, 0.99], (0.76, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.045, 0.28] < (0.28, 0.52] < (0.52, 0.76] < (0.76, 0.99]]

In [144]:
data = np.random.randn(1000) #Normally distributed
cats = pd.qcut(data,q=4)#4 for quartiles, 10 for deciles
cats

[(-3.0909999999999997, -0.724], (0.0116, 0.686], (-0.724, 0.0116], (-3.0909999999999997, -0.724], (-0.724, 0.0116], ..., (0.0116, 0.686], (0.686, 3.054], (-0.724, 0.0116], (0.0116, 0.686], (0.686, 3.054]]
Length: 1000
Categories (4, interval[float64]): [(-3.0909999999999997, -0.724] < (-0.724, 0.0116] < (0.0116, 0.686] < (0.686, 3.054]]

In [145]:
pd.value_counts(cats)

(0.686, 3.054]                   250
(0.0116, 0.686]                  250
(-0.724, 0.0116]                 250
(-3.0909999999999997, -0.724]    250
dtype: int64

In [146]:
pd.qcut(data,[0, 0.1, 0.5, 0.8, 1])

[(-3.0909999999999997, -1.291], (0.0116, 0.842], (-1.291, 0.0116], (-1.291, 0.0116], (-1.291, 0.0116], ..., (0.0116, 0.842], (0.0116, 0.842], (-1.291, 0.0116], (0.0116, 0.842], (0.0116, 0.842]]
Length: 1000
Categories (4, interval[float64]): [(-3.0909999999999997, -1.291] < (-1.291, 0.0116] < (0.0116, 0.842] < (0.842, 3.054]]

### Filter Out the Outliers

In [149]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033204    -0.013170     0.013428    -0.032516
std       1.010332     0.997005     1.011428     1.005332
min      -3.033954    -3.113406    -3.395060    -3.594021
25%      -0.725259    -0.666023    -0.647134    -0.723476
50%      -0.029211     0.031263     0.022191    -0.008294
75%       0.642621     0.619594     0.647185     0.607968
max       3.713511     4.651961     3.330297     3.354155

In [150]:
col = data[2]

In [152]:
col[np.abs(col)>3]

92     3.330297
429   -3.395060
448    3.288108
544    3.299963
669    3.192958
722    3.067970
Name: 2, dtype: float64

In [157]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
15   2.093918  4.651961  0.394164  0.054140
92   0.390881  0.755433  3.330297 -1.103939
146 -0.272382  1.092670  0.331449  3.269899
147 -1.962810  1.234190 -0.145586 -3.594021
152  0.322857  3.108798  0.687775 -1.903766
165 -3.033954 -1.855900  0.031323  1.575708
224 -1.016366  3.011514 -0.027683 -0.305345
231  0.490077 -3.034200  0.520952  1.083638
373 -0.782207  0.498725  0.295263  3.354155
429  1.454787  0.434969 -3.395060  0.196841
448 -1.219312 -1.335018  3.288108  2.020038
544 -0.774320  0.172363  3.299963 -1.204751
669 -0.315796  0.369991  3.192958 -0.506874
722 -1.039023  1.277920  3.067970  0.166162
764  3.713511  0.896156  0.360346 -0.102348
861  1.423687 -3.113406 -0.096497 -0.699401

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [164]:
data[np.abs(data) > 3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033883    -0.014794     0.012644    -0.032546
std       1.007832     0.989790     1.006514     1.001411
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.725259    -0.666023    -0.647134    -0.723476
50%      -0.029211     0.031263     0.022191    -0.008294
75%       0.642621     0.619594     0.647185     0.607968
max       3.000000     3.000000     3.000000     3.000000

In [165]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0 -1.0
1  1.0 -1.0 -1.0 -1.0
2  1.0  1.0 -1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0 -1.0

### Reshaping Data

In [166]:
#Create a Hierarchy of index
data = pd.Series(np.random.randn(9), 
                index = [['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                         [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.171322
   2   -1.244955
   3    0.752369
b  1    1.413610
   3   -1.611162
c  1    1.209516
   2    0.731779
d  2   -0.144854
   3   -0.295976
dtype: float64

In [169]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [170]:
data['b']

1    1.413610
3   -1.611162
dtype: float64

In [171]:
data['b':'c']

b  1    1.413610
   3   -1.611162
c  1    1.209516
   2    0.731779
dtype: float64

In [172]:
data.loc[['b','d']]

b  1    1.413610
   3   -1.611162
d  2   -0.144854
   3   -0.295976
dtype: float64

In [173]:
data.loc[:,2]

a   -1.244955
c    0.731779
d   -0.144854
dtype: float64

In [174]:
data.unstack()

          1         2         3
a  0.171322 -1.244955  0.752369
b  1.413610       NaN -1.611162
c  1.209516  0.731779       NaN
d       NaN -0.144854 -0.295976

In [175]:
data

a  1    0.171322
   2   -1.244955
   3    0.752369
b  1    1.413610
   3   -1.611162
c  1    1.209516
   2    0.731779
d  2   -0.144854
   3   -0.295976
dtype: float64

In [176]:
data.unstack().stack()

a  1    0.171322
   2   -1.244955
   3    0.752369
b  1    1.413610
   3   -1.611162
c  1    1.209516
   2    0.731779
d  2   -0.144854
   3   -0.295976
dtype: float64

In [177]:
frame = pd.DataFrame(np.arange(12).reshape((4,3)),
                    index=[['a', 'a', 'b', 'b'], [1,2,1,2]],
                    columns = [['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [180]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [181]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [182]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [183]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [184]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11